backend/controllers/GoodsBrandController.php

INSERT INTO `goods_brand` (`category_id`, `name_cn`, `name_en`, `logo`, `url`, `intro`, `story`, `created_at`) VALUES (4, '中文名', 'english', '6.jpg', '', '', '', 1416924843)
---
    public function actionCreate()
    {
        $model = new GoodsBrand();

        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            $upload = Upload::getInstance($model, 'logo');
            $img = new Attachment;
            $img->setInfo($upload, 'goods_brand_logo')->save();

SELECT * FROM `goods_brand` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = GoodsBrand::findOne($id)) !== null) {