backend/modules/menu/controllers/DefaultController.php

INSERT INTO `menu` (`pid`, `name`, `app_name`, `controller_name`, `action_name`, `icon`, `auth_name`, `status`, `created_at`) VALUES (13, '品牌管理', 'backend', 'goods-brand', 'index', '', 'backend-goods-brand-index', 1, 1416923695)
---
    public function actionCreate()
    {

        $model = new Menu();
        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `menu` WHERE `id`='15'
---
    protected function findModel($id)
    {
        if (($model = Menu::findOne($id)) !== null) {