backend/modules/menu/models/Menu.php

    public static function getMenus()
    {
        $menus = self::find()
                    ->where(['status' => self::STATUS_ACTIVE])
                    ->orderBy('sort')
                    ->asArray()
                    ->all();
---
SELECT * FROM `menu` WHERE `status`=1 ORDER BY `sort`

    public function getMenu($is_select=true)
    {
        $menus = self::find()
                    ->where(['status' => self::STATUS_ACTIVE])
                    ->asArray()
                    ->all();
---
SELECT * FROM `menu` WHERE `status`=1